# SubSchema Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..SubSchema Property
Field Class See Also
---
The Schema describing the subentity (or subentities) stored in this Field.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Schema SubSchema { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SubSchema As Schema
	Get
```

Visual C++
---
```text
public:
property Schema^ SubSchema {
	Schema^ get ();
}
```

# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace